Revit 2027 API
FamilyManager.Parameters Property
All family parameters in this family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameterSet Parameters { get; }
Public ReadOnly Property Parameters As FamilyParameterSet
	Get
public:
property FamilyParameterSet^ Parameters {
	FamilyParameterSet^ get ();
}
member Parameters : FamilyParameterSet with get
Property Value
FamilyParameterSet
Remarks
These parameters will include the 'family parameter', 'shared parameter' and 'builtIn parameter' binding to the family types. Some parameters might be created as placeholders without a currently assigned value.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace